In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 7.1处理缺失数据

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# 滤除缺失数据

In [9]:
data = pd.Series([1,np.nan,3.5,np.nan,7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]      #与上面的命令等价

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned = data.dropna()    #默认删除任何含有（any）缺失值的行

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
cleaned = data.dropna(how='all')    #删除全部（all）为缺失值的行

In [21]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [37]:
df = DataFrame(np.random.randn(7,3))

In [38]:
df

          0         1         2
0 -0.189775  2.078542  0.977100
1  0.073857 -1.150923 -0.329139
2 -0.119954 -0.488970  0.538683
3  2.120245 -0.860837  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [39]:
df.iloc[:4, 1] = np.nan

In [40]:
df.iloc[:2, 2] = np.nan

In [41]:
df

          0         1         2
0 -0.189775       NaN       NaN
1  0.073857       NaN       NaN
2 -0.119954       NaN  0.538683
3  2.120245       NaN  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [42]:
df.dropna()

          0         1         2
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [43]:
df.dropna(thresh=2)     #保留至少有2个非NaN数据的行

          0         1         2
2 -0.119954       NaN  0.538683
3  2.120245       NaN  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [44]:
df.iloc[0,0] = np.nan

In [45]:
df

          0         1         2
0       NaN       NaN       NaN
1  0.073857       NaN       NaN
2 -0.119954       NaN  0.538683
3  2.120245       NaN  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [47]:
df.dropna(thresh=1)    #保留非NaN数据大于等于1的行

          0         1         2
1  0.073857       NaN       NaN
2 -0.119954       NaN  0.538683
3  2.120245       NaN  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

# 填充缺失数据

In [48]:
df.fillna(0)    #缺失值全部填充为0

          0         1         2
0  0.000000  0.000000  0.000000
1  0.073857  0.000000  0.000000
2 -0.119954  0.000000  0.538683
3  2.120245  0.000000  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [50]:
df.fillna({1:0.5, 2:0})     #不同的列填充不同的值，1列填充0.5，2列填充0

          0         1         2
0       NaN  0.500000  0.000000
1  0.073857  0.500000  0.000000
2 -0.119954  0.500000  0.538683
3  2.120245  0.500000  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [51]:
_ = df.fillna(0, inplace=True)

In [53]:
df

          0         1         2
0  0.000000  0.000000  0.000000
1  0.073857  0.000000  0.000000
2 -0.119954  0.000000  0.538683
3  2.120245  0.000000  1.105401
4  0.189152 -0.618621 -1.040542
5 -0.456889  0.977791 -0.154295
6 -0.614709  2.425239 -0.213983

In [54]:
df = pd.DataFrame(np.random.randn(6,3))

In [55]:
df.iloc[2:, 1] = np.nan

In [56]:
df.iloc[4: ,2] = np.nan

In [57]:
df

          0         1         2
0 -0.009587 -0.149223  0.077976
1  0.281540 -0.660927  0.092062
2  0.993709       NaN -0.720516
3 -0.460431       NaN -1.792720
4 -0.508320       NaN       NaN
5  1.092715       NaN       NaN

In [58]:
df.fillna(method='ffill')

          0         1         2
0 -0.009587 -0.149223  0.077976
1  0.281540 -0.660927  0.092062
2  0.993709 -0.660927 -0.720516
3 -0.460431 -0.660927 -1.792720
4 -0.508320 -0.660927 -1.792720
5  1.092715 -0.660927 -1.792720

In [60]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.009587 -0.149223  0.077976
1  0.281540 -0.660927  0.092062
2  0.993709 -0.660927 -0.720516
3 -0.460431 -0.660927 -1.792720
4 -0.508320       NaN -1.792720
5  1.092715       NaN -1.792720

In [61]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [62]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [63]:
data.fillna(data.mean())   #填充成平均值

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [65]:
data.fillna(method = 'bfill')

0    1.0
1    3.5
2    3.5
3    7.0
4    7.0
dtype: float64

# 7.2 数据转换

In [68]:
data = DataFrame({'k1':['one', 'two'] * 3 + ['two'], 'k2': [1,1,2,3,3,4,4]})

In [69]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [70]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [71]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [74]:
data['v1'] = range(7)

In [75]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [76]:
data.drop_duplicates(['k1'])   #根据k1列过滤重复项

    k1  k2  v1
0  one   1   0
1  two   1   1

In [77]:
data.drop_duplicates(['k1','k2'], keep='last')  #保留最后一个出现的值组合

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# 利用函数或映射进行数据转换

In [78]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                 'ounce': [4,3,12,6,7.5,8,3,5,6]})

In [79]:
data

          food  ounce
0        bacon    4.0
1  pulled pork    3.0
2        bacon   12.0
3     Pastrami    6.0
4  corned beef    7.5
5        Bacon    8.0
6     pastrami    3.0
7    honey ham    5.0
8     nova lox    6.0

In [80]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [81]:
lowercased = data['food'].str.lower()

In [82]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [83]:
data['animal'] = lowercased.map(meat_to_animal)     #增加一列，用映射将字典中的内容一一对应到表格中

In [84]:
data

          food  ounce  animal
0        bacon    4.0     pig
1  pulled pork    3.0     pig
2        bacon   12.0     pig
3     Pastrami    6.0     cow
4  corned beef    7.5     cow
5        Bacon    8.0     pig
6     pastrami    3.0     cow
7    honey ham    5.0     pig
8     nova lox    6.0  salmon

In [85]:
data['food'].map(lambda x: meat_to_animal[x.lower()])    #传入一个能够完成全部这些工作的函数

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# 替换值

In [86]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [87]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [88]:
data.replace(-999., np.nan)   #前面是需要替换值，后面是替换后的值

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [90]:
data.replace([-999, -1000], np.nan)   #多个值一起被替换

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [91]:
data.replace([-999,-1000], [np.nan, 0])   #替换成不同的对象

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [92]:
data.replace({-999:np.nan, -1000: 0})    #用字典的形式也可以进行替换

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# 重命名轴索引

In [96]:
data = DataFrame(np.arange(12).reshape(3,4), 
                 index=['Ohio', 'Colorado', 'New York'],
                columns=['one', 'two', 'three', 'four'])

In [97]:
transform = lambda x: x[:4].upper()

In [98]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [99]:
data.index = data.index.map(transform)

In [100]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [101]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [102]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [103]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [104]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# 离散化和面元划分

In [105]:
ages = [20, 22, 25, 27,21, 23, 37, 31, 61, 45, 41, 32 ]

In [107]:
bins = [18, 25, 35, 60, 100]    #需要将上面list的数据划分成几个面元：18-25， 25-35， 35-60， 60-100

In [108]:
cats = pd.cut(ages, bins)

In [109]:
cats #这样显示出来的就是每个数所在的区间

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [110]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [111]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [112]:
pd.value_counts(cats)    #计算每个区间的年龄的数量

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [113]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)   #表示左闭右开的区间

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [114]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [115]:
pd.cut(ages, bins, labels=group_names)   #设置对应区间的名称（比如第一个区间表示年轻）

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [116]:
pd.value_counts(pd.cut(ages, bins, labels=group_names))

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

In [117]:
df = DataFrame(ages, columns=['ages'])   #体现在表格里面的效果

In [119]:
df['age level'] = pd.cut(ages, bins, labels=group_names)

In [120]:
df

    ages   age level
0     20       Youth
1     22       Youth
2     25       Youth
3     27  YoungAdult
4     21       Youth
5     23       Youth
6     37  MiddleAged
7     31  YoungAdult
8     61      Senior
9     45  MiddleAged
10    41  MiddleAged
11    32  YoungAdult

In [121]:
data = np.random.rand(20)

In [122]:
pd.cut(data, 4, precision=2)   #表示需要划分4个面元，从而cut会根据数据的最大值最小值计算等长的面元

[(0.00078, 0.25], (0.25, 0.5], (0.5, 0.75], (0.25, 0.5], (0.5, 0.75], ..., (0.00078, 0.25], (0.00078, 0.25], (0.00078, 0.25], (0.75, 1.0], (0.75, 1.0]]
Length: 20
Categories (4, interval[float64]): [(0.00078, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [123]:
data = np.random.randn(1000)  #正态分布

In [124]:
cats = pd.qcut(data, 4)    #划分成分位数

In [125]:
cats

[(-0.653, -0.0239], (-3.755, -0.653], (-0.653, -0.0239], (0.629, 3.601], (-3.755, -0.653], ..., (-0.653, -0.0239], (-3.755, -0.653], (0.629, 3.601], (-3.755, -0.653], (0.629, 3.601]]
Length: 1000
Categories (4, interval[float64]): [(-3.755, -0.653] < (-0.653, -0.0239] < (-0.0239, 0.629] < (0.629, 3.601]]

In [126]:
pd.value_counts(cats)    #每个面元内的数据数量是相同的

(0.629, 3.601]       250
(-0.0239, 0.629]     250
(-0.653, -0.0239]    250
(-3.755, -0.653]     250
dtype: int64

In [129]:
dogs = pd.qcut(data, [0,0.1,0.5,0.9,1])   #可以自己定义分位数

In [130]:
pd.value_counts(dogs)

(-0.0239, 1.201]     400
(-1.211, -0.0239]    400
(1.201, 3.601]       100
(-3.755, -1.211]     100
dtype: int64

# 检测和过滤异常值

In [131]:
data = DataFrame(np.random.randn(1000,4))

In [132]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.019910    -0.025386     0.022515     0.023396
std       1.010235     0.969627     1.029844     0.987037
min      -2.818751    -3.128578    -3.146727    -3.188282
25%      -0.672666    -0.653595    -0.623967    -0.628637
50%       0.009560    -0.025248     0.044270     0.024764
75%       0.691614     0.616204     0.697880     0.696396
max       3.084733     3.455505     2.976811     3.835476

In [133]:
col = data[2]   #选定2号列

In [134]:
col[np.abs(col)>3]     #找出2号列中绝对值大于3的值

324   -3.146727
492   -3.103681
945   -3.139360
955   -3.007809
Name: 2, dtype: float64

In [136]:
data[(np.abs(data)>3).any(1)]    #选出含有绝对值大于3的数的行

            0         1         2         3
4   -0.914480 -1.048874  0.996258  3.835476
161 -0.270108  3.122264  0.206392 -0.274076
179 -0.294843 -0.433784 -0.618957 -3.119140
235 -1.258202 -3.128578 -0.387536 -1.540290
302 -1.631519 -0.814018 -1.053710  3.282374
324  0.465675 -1.077081 -3.146727  0.167169
340  3.084733 -0.352618  0.192016  0.681334
492  1.115242  0.388241 -3.103681  0.949887
520 -1.846243 -1.888929  0.895316 -3.188282
726 -0.191673  3.455505 -0.409288 -0.454617
787 -0.967098  3.251900 -0.607154  0.863726
871  1.119199  3.377890  0.816322 -0.210276
945  0.214433 -0.096669 -3.139360  1.227084
955  0.452234  0.228753 -3.007809  0.988326

In [139]:
data[np.abs(data)>3] = np.sign(data) * 3    #将值限制在-3到3之间

In [140]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.019825    -0.026465     0.022913     0.022585
std       1.009981     0.965220     1.028650     0.982288
min      -2.818751    -3.000000    -3.000000    -3.000000
25%      -0.672666    -0.653595    -0.623967    -0.628637
50%       0.009560    -0.025248     0.044270     0.024764
75%       0.691614     0.616204     0.697880     0.696396
max       3.000000     3.000000     2.976811     3.000000

# 排列和随机采样

In [141]:
df = DataFrame(np.arange(5 * 4).reshape(5,4))

In [142]:
sampler = np.random.permutation(5)

In [143]:
sampler

array([3, 1, 4, 2, 0])

In [144]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [145]:
df.take(sampler)   #调换行的顺序

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [147]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [151]:
df.sample(n=3)   #随机抽取三行

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [152]:
choices = Series([5, 7, -1, 6, 4])

In [154]:
draws = choices.sample(n=10, replace=True)

In [155]:
draws

4    4
1    7
4    4
0    5
3    6
3    6
2   -1
0    5
3    6
4    4
dtype: int64

# 计算指标/哑变量

In [158]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
               'data1': range(6)})

In [160]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [159]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [161]:
dummies = pd.get_dummies(df['key'], prefix='key')   #增加前缀

In [162]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [163]:
mnames = ['movie_id', 'title', 'genres']

In [167]:
movies = pd.read_table('C:/Users/zoe_x/Documents/python/pydata-book-2nd-edition/datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [168]:
movies[:10]   #前十行

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [169]:
all_genres = []

In [170]:
for x in movies.genres:
    all_genres.extend(x.split('|'))  #将movies表格中列genres中的内容按照|划分开，并将分开后的内容填充到列表all_genres中去

In [171]:
genres = pd.unique(all_genres)

In [172]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [173]:
zero_matrix = np.zeros((len(movies), len(genres)))  #生成0矩阵

In [174]:
dummies = DataFrame(zero_matrix, columns=genres)

In [176]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [177]:
gen = movies.genres[0] #取这一列的第一行的内容

In [178]:
gen

"Animation|Children's|Comedy"

In [179]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [180]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [182]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [183]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [184]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object